cask_args appdir: "/Applications"

tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

brew "awscli"
brew "certbot"
brew "ffmpeg"
brew "git"
# brew "heroku/brew/heroku"
brew "java"
brew "jenv"
brew "mas" # Mac App Store
brew "nvm"
brew "openssl"
brew "postgresql", restart_service: true
brew "python"
brew "python@2"
brew "r"
brew "rbenv"
brew "rbenv-vars"
brew "ruby-build" # rbenv installs it, but also, let's be explicit
# brew "redis"
# brew "sass/sass/sass"
brew "sqlite"
brew "svn" # Necessary for fonts, apparently
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-completions"

# Applications
cask "1password"
cask "acorn"
cask "adoptopenjdk8"
cask "anki"
cask "backblaze"
cask "backblaze-downloader"
cask "bbedit"
cask "camo-studio"
cask "clockify"
cask "docker"
cask "encryptme"
cask "figma"
cask "finicky"
cask "firefox"
cask "freedom"
cask "google-chrome"
cask "handbrake"
cask "keybase"
cask "launchbar"
# cask "local" # For WordPress development; disable if unused
cask "maestral" # Open-source Dropbox
cask "netnewswire"
cask "obsidian"
cask "paw"
cask "postico"
cask "retrobatch"
cask "rstudio"
cask "sequel-pro"
cask "signal"
cask "sizeup"
cask "slack"
cask "superduper"
cask "spotify"
cask "textmate"
cask "the-unarchiver"
cask "todoist"
cask "tower"
cask "transmit"
cask "tweetbot"
cask "visual-studio-code"
cask "vlc"
cask "xscope"
cask "zoom"

# Mac App Store apps
mas "Brother iPrint&Scan", id: 1193539993
mas "Ghostery Lite", id: 1436953057
mas "Hush Nag Blocker", id: 1544743900
mas "Highland 1", id: 499329572
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Simplenote", id: 692867256
mas "Soulver 2", id: 413965349
mas "Speedtest", id: 1153157709
mas "StopTheMadness", id: 1376402589
# mas "Todoist", id: 585829637
mas "Ulysses 2", id: 623795237

# Fonts
cask "font-archivo"
cask "font-eb-garamond"
cask "font-glegoo"
cask "font-im-fell-english"
cask "font-inconsolata"
cask "jetbrains-mono"
cask "font-open-sans"
cask "font-redacted"
cask "font-roboto"
cask "font-teko"
# These don't work, but I wish they did:
# cask "font-nexa-rust"
# cask "font-gotham"