cask_args appdir: "/Applications"

brew "awscli"
brew "certbot"
brew "direnv" # Auto-load .env files
brew "ffmpeg"
brew "git"
# brew "heroku/brew/heroku"
brew "iterm2"
brew "jenv"
brew "mas" # Mac App Store
brew "nvm"
brew "openssl"
brew "postgresql", restart_service: true
brew "python"
# brew "r" # As needed
brew "rbenv"
brew "rbenv-vars"
brew "ruby-build" # rbenv installs it, but also, let's be explicit
# brew "redis"
# brew "sass/sass/sass"
brew "sqlite"
brew "svn" # Necessary for fonts, apparently
brew "wget"
brew "yarn"
brew "yt-dlp"
brew "z"
brew "zsh"
brew "zsh-completions"

# Applications
cask "1password"
cask "acorn"
cask "affinity-photo"
cask "airtable"
cask "anki"
cask "backblaze"
cask "backblaze-downloader"
cask "bbedit"
cask "blackhole-2ch" # Expose audio output as an input
cask "clockify"
cask "discord"
# cask "docker" # As needed
cask "encryptme"
cask "figma"
cask "finicky"
cask "firefox"
cask "freedom"
cask "google-chrome"
cask "handbrake"
cask "imageoptim"
cask "launchbar"
# cask "local" # WordPress development; as needed
cask "maestral" # Open-source Dropbox
cask "macwhisper" # Audio transcription
cask "marathon"
cask "marathon-2"
cask "marathon-infinity"
cask "microsoft-edge"
cask "netnewswire"
cask "obsidian"
cask "outline-manager" # Private VPN manager
cask "polypane" # Developmer-focused web browser
cask "postico" # PostgreSQL database tool
cask "rapidapi" # MySQL database tool
cask "rectangle" # Window management
cask "retrobatch" # Batch image processor
cask "sequel-ace"
cask "signal"
cask "slack"
cask "steam" # Gaming platform
cask "swinsian" # Local music player
cask "superduper" # Hard drive cloning
cask "temurin8" # ARM Java
cask "textmate"
cask "the-unarchiver"
cask "todoist"
cask "tower"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vivid" # Turbo brightness
cask "vlc"
cask "whatsapp"
cask "xscope"
cask "zoom"

# Mac App Store apps
mas "Brother iPrint&Scan", id: 1193539993
mas "Focus", id: 1554411065 # Pomodoro timer
mas "Highland 1", id: 499329572
mas "Ivory", id: 6444602274 # Mastodon app
mas "Play", id: 1596506190 # Save YouTube videos
mas "Prime Video", id: 545519333
mas "Ulysses 2", id: 623795237

# Safari plugins
mas "Ghostery", id: 1436953057
mas "Hush", id: 1544743900 # Stop cookie consent dialogs
mas "StopTheMadness", id: 1376402589 # Override bad website UI
mas "Vinegar", id: 1591303229 # HTML5-ify YouTube videos

# Fonts
cask "font-archivo"
cask "font-eb-garamond"
cask "font-glegoo"
cask "font-im-fell-english"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-redacted"
cask "font-roboto"
cask "font-teko"
# These don't work, but I wish they did:
# cask "font-nexa-rust"
# cask "font-gotham"
